<?php


namespace WptUtils;

class Address
{
    /**
     * 获取地区全名 例子: 内蒙古 -> 内蒙古自治区
     * @param string $province
     * @param string $city
     * @param string $region
     * @return array
     */
    public static function getFullAddress($province = '', $city = '', $region = '')
    {
        $result = [];
        if ($province) {
            $provinces = [
                '河北', '山西', '辽宁', '吉林', '黑龙江', '江苏',
                '浙江', '安徽', '福建', '江西', '山东', '河南',
                '湖北', '湖南', '广东', '海南', '四川', '贵州',
                '云南', '陕西', '甘肃', '青海'
            ];
            $municipalities = ['北京', '天津', '上海', '重庆'];
            $autonomousRegion = [
                '内蒙古' => '内蒙古自治区',
                '广西' => '广西壮族自治区',
                '西藏' => '西藏自治区',
                '新疆' => '新疆维吾尔自治区',
                '宁夏' => '宁夏回族自治区'
            ];

            if (in_array($province, $provinces)) {
                $province .= '省';
                //普通省里中的 特殊城市名
                $cities = [
                    '延边' => '延边朝鲜族自治州',
                    '大兴安岭' => '大兴安岭地区',
                    '济源' => '省直辖县级行政区划',
                    '恩施' => '恩施土家族苗族自治州',
                    '湘西' => '湘西土家族苗族自治州',
                    '阿坝' => '阿坝藏族羌族自治州',
                    '甘孜' => '甘孜藏族自治州',
                    '凉山' => '凉山彝族自治州',
                    '黔西' => '黔西南布依族苗族自治州',
                    '黔东' => '黔东南苗族侗族自治州',
                    '黔南' => '黔南布依族苗族自治州',
                    '楚雄' => '楚雄彝族自治州',
                    '红河' => '红河哈尼族彝族自治州',
                    '文山' => '文山壮族苗族自治州',
                    '西双版纳' => '西双版纳傣族自治州',
                    '大理' => '大理白族自治州',
                    '德宏' => '德宏傣族景颇族自治州',
                    '怒江' => '怒江傈傈族自治州',
                    '迪庆' => '迪庆藏族自治州',
                    '临夏' => '临夏回族自治州',
                    '甘南' => '甘南藏族自治州',
                    '海东' => '海东地区',
                    '海北' => '海北藏族自治州',
                    '黄南' => '黄南藏族自治州',
                    '海南' => '海南藏族自治州',
                    '果洛' => '果洛藏族自治州',
                    '玉树' => '玉树藏族自治州',
                    '海西' => '海西蒙古族藏族自治州'
                ];
                if (isset($cities[$city])) {
                    $city = $cities[$city];
                } else {
                    $city .= '市';
                }
            } elseif (in_array($province, $municipalities)) {
                $province .= '市';
                //直辖市中的特殊地名
                $cities = [
                    '密云' => '密云县',
                    '延庆' => '延庆县',
                    '宁河' => '宁河县',
                    '静海' => '静海县',
                    '蓟县' => '蓟县',
                    '崇明' => '崇明县',
                    '潼南' => '潼南县',
                    '铜梁' => '铜梁县',
                    '荣昌' => '荣昌县',
                    '璧山' => '璧山县',
                    '梁平' => '梁平县',
                    '城口' => '城口县',
                    '丰都' => '丰都县',
                    '垫江' => '垫江县',
                    '武隆' => '武隆县',
                    '忠县' => '忠县',
                    '开县' => '开县',
                    '云阳' => '云阳县',
                    '奉节' => '奉节县',
                    '巫山' => '巫山县',
                    '巫溪' => '巫溪县',
                    '石柱' => '石柱土家族自治县',
                    '秀山' => '秀山土家族苗族自治县',
                    '酉阳' => '酉阳土家族苗族自治县',
                    '彭水' => '彭水苗族土家族自治县'
                ];
                if (isset($cities[$city])) {
                    $region = $cities[$city];
                    $city = '县';
                } else {
                    $region = $city . '区';
                    $city = $province;
                }
            } elseif (array_key_exists($province, $autonomousRegion)) {
                $province = $autonomousRegion[$province];
                //自治区中的特殊地名
                $cities = [
                    '兴安' => '兴安盟',
                    '锡林' => '锡林郭勒盟',
                    '阿拉' => '阿拉善盟',
                    '昌都' => '昌都地区',
                    '山南' => '山南地区',
                    '日喀则' => '日喀则地区',
                    '那曲' => '那曲地区',
                    '阿里' => '阿里地区',
                    '林芝' => '林芝地区',
                    '吐鲁番' => '吐鲁番地区',
                    '哈密' => '哈密地区',
                    '昌吉' => '昌吉回族自治区',
                    '博尔塔拉' => '博尔塔拉蒙古自治州',
                    '巴音郭楞' => '巴音郭楞蒙古自治州',
                    '阿克苏' => '阿克苏地区',
                    '克孜勒苏' => '克孜勒苏柯尔克牧自治州',
                    '喀什' => '喀什地区',
                    '和田' => '和田地区',
                    '伊犁' => '伊犁哈萨克自治州',
                    '塔城' => '塔城地区',
                    '阿勒泰' => '阿勒泰地区'
                ];
                if (isset($cities[$city])) {
                    $city = $cities[$city];
                } else {
                    $city .= '市';
                }
            }
            $result = ['province' => $province, 'city' => $city, 'region' => $region];
        }
        return $result;
    }
}
